export const COLLEGES = [
  {
    "name": "กาญจนาภิเษกวิทยาลัย ช่างทองหลวง",
    "province": "กรุงเทพมหานคร",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยการพาณิชย์นาวีนครศรีธรรมราช",
    "province": "นครศรีธรรมราช",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพกบินทร์บุรี",
    "province": "ปราจีนบุรี",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยการอาชีพกระนวน",
    "province": "ขอนแก่น",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพกระบุรี",
    "province": "ระนอง",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพกันตัง",
    "province": "ตรัง",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพกาญจนบุรี",
    "province": "กาญจนบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพกาญจนาภิเษกหนองจอก",
    "province": "กรุงเทพมหานคร",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยการอาชีพกาฬสินธุ์",
    "province": "กาฬสินธุ์",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพกุมภวาปี",
    "province": "อุดรธานี",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพขอนแก่น",
    "province": "ขอนแก่น",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพขาณุวรลักษบุรี",
    "province": "กำแพงเพชร",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพขุขันธ์",
    "province": "ศรีสะเกษ",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพขุนหาญ",
    "province": "ศรีสะเกษ",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพคลองท่อม",
    "province": "กระบี่",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพควนขนุน",
    "province": "พัทลุง",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพคำชะอี",
    "province": "มุกดาหาร",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพคำม่วง",
    "province": "กาฬสินธุ์",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพจอมทอง",
    "province": "เชียงใหม่",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพชนแดน",
    "province": "เพชรบูรณ์",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพชัยบาดาล",
    "province": "ลพบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพชุมพร",
    "province": "ชุมพร",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพชุมพวง",
    "province": "นครราชสีมา",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพดอนตาล",
    "province": "มุกดาหาร",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพด่านซ้าย",
    "province": "เลย",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพตรัง",
    "province": "ตรัง",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพตะกั่วป่า",
    "province": "พังงา",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพตากฟ้า",
    "province": "นครสวรรค์",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพทองผาภูมิ",
    "province": "กาญจนบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพท่าตูม",
    "province": "สุรินทร์",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพท่าแซะ",
    "province": "ชุมพร",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพท้ายเหมือง",
    "province": "พังงา",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพนครนายก",
    "province": "นครนายก",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยการอาชีพนครปฐม",
    "province": "นครปฐม",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพนครยะลา",
    "province": "ยะลา",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพนครศรีธรรมราช",
    "province": "นครศรีธรรมราช",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพนครสวรรค์",
    "province": "นครสวรรค์",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพนครไทย",
    "province": "พิษณุโลก",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพนวมินทราชินีแม่ฮ่องสอน",
    "province": "แม่ฮ่องสอน",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพนวมินทราชูทิศ",
    "province": "กรุงเทพมหานคร",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยการอาชีพนาทวี",
    "province": "สงขลา",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพนายายอาม",
    "province": "จันทบุรี",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยการอาชีพนาแก",
    "province": "นครพนม",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพนิคมคำสร้อย",
    "province": "มุกดาหาร",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพบรรพตพิสัย",
    "province": "นครสวรรค์",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพบางปะกง",
    "province": "ฉะเชิงเทรา",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยการอาชีพบางแก้ว",
    "province": "พัทลุง",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพบางแก้วฟ้า (หลวงพ่อเปิ่นอุปถัมภ์)",
    "province": "นครปฐม",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพบำเหน็จณรงค์",
    "province": "ชัยภูมิ",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพบุรีรัมย์",
    "province": "บุรีรัมย์",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพบ่อไร่",
    "province": "ตราด",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยการอาชีพบ้านตาก",
    "province": "ตาก",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพบ้านผือ",
    "province": "อุดรธานี",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพบ้านลาด",
    "province": "เพชรบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพบ้านแพ้ว",
    "province": "สมุทรสาคร",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพบ้านโป่ง",
    "province": "ราชบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพบ้านโฮ่ง",
    "province": "ลำพูน",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพบ้านไผ่",
    "province": "ขอนแก่น",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพปง",
    "province": "พะเยา",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพประโคนชัย",
    "province": "บุรีรัมย์",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพปราจีนบุรี",
    "province": "ปราจีนบุรี",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยการอาชีพปราณบุรี",
    "province": "ประจวบคีรีขันธ์",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพปราสาท",
    "province": "สุรินทร์",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพปะเหลียน",
    "province": "ตรัง",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพปัตตานี",
    "province": "ปัตตานี",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพปากท่อ",
    "province": "ราชบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพป่าซาง",
    "province": "ลำพูน",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพฝาง",
    "province": "เชียงใหม่",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพพนมทวน",
    "province": "กาญจนบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพพนมไพร",
    "province": "ร้อยเอ็ด",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพพนัสนิคม",
    "province": "ชลบุรี",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยการอาชีพพรรณานิคม",
    "province": "สกลนคร",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพพรหมคีรี",
    "province": "นครศรีธรรมราช",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพพระสมุทรเจดีย์",
    "province": "สมุทรปราการ",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยการอาชีพพล",
    "province": "ขอนแก่น",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพพิชัย",
    "province": "อุตรดิตถ์",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพพุทธมณฑล",
    "province": "นครปฐม",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพมหาราช",
    "province": "พระนครศรีอยุธยา",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพมหาสารคาม",
    "province": "มหาสารคาม",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพรัตนประสิทธิ์วิทย์",
    "province": "อุตรดิตถ์",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพรามัน",
    "province": "ยะลา",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพร้อยเอ็ด",
    "province": "ร้อยเอ็ด",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพลอง",
    "province": "แพร่",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพละงู",
    "province": "สตูล",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพลำปลายมาศ",
    "province": "บุรีรัมย์",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพวังสะพุง",
    "province": "เลย",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพวังไกลกังวล",
    "province": "ประจวบคีรีขันธ์",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพวังไกลกังวล 2",
    "province": "เพชรบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพวัดโฆสมังคลาราม",
    "province": "นครพนม",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพวารินชำราบ",
    "province": "อุบลราชธานี",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพวิเชียรบุรี",
    "province": "เพชรบูรณ์",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพวิเศษชัยชาญ",
    "province": "อ่างทอง",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพศรีบุญเรือง",
    "province": "หนองบัวลำภู",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพศรีสะเกษ",
    "province": "ศรีสะเกษ",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพศรีสัชนาลัย",
    "province": "สุโขทัย",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพศรีสำโรง",
    "province": "สุโขทัย",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพศีขรภูมิ",
    "province": "สุรินทร์",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพสตึก",
    "province": "บุรีรัมย์",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพสมเด็จเจ้าพะโคะ",
    "province": "สงขลา",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพสระบุรี",
    "province": "สระบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพสอง",
    "province": "แพร่",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพสองพี่น้อง",
    "province": "สุพรรณบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพสอยดาว",
    "province": "จันทบุรี",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยการอาชีพสังขะ",
    "province": "สุรินทร์",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพสายบุรี",
    "province": "ปัตตานี",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพสิงหนคร (รัตน์ ประธานราษฎร์นิกร)",
    "province": "สงขลา",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพสุไหงโก-ลก",
    "province": "นราธิวาส",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพหนองกุงศรี",
    "province": "กาฬสินธุ์",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพหนองคาย",
    "province": "หนองคาย",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพหนองสองห้อง",
    "province": "ขอนแก่น",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพหนองหาน",
    "province": "อุดรธานี",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพหนองแค",
    "province": "สระบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพหลวงประธานราษฎร์นิกร",
    "province": "สงขลา",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพหลังสวน",
    "province": "ชุมพร",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพหัวไทร",
    "province": "นครศรีธรรมราช",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพห้วยผึ้ง",
    "province": "กาฬสินธุ์",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพห้วยยอด",
    "province": "ตรัง",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพองครักษ์",
    "province": "นครนายก",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยการอาชีพอัมพวา",
    "province": "สมุทรสงคราม",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพอินทร์บุรี",
    "province": "สิงห์บุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพอุดรธานี",
    "province": "อุดรธานี",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพอู่ทอง",
    "province": "สุพรรณบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพอ่าวลึก",
    "province": "กระบี่",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพเกาะสมุย",
    "province": "สุราษฎร์ธานี",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพเขาย้อย",
    "province": "เพชรบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพเชียงราย",
    "province": "เชียงราย",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพเถิน",
    "province": "ลำปาง",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพเนินขาม",
    "province": "ชัยนาท",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพเบตง",
    "province": "ยะลา",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพเวียงสระ",
    "province": "สุราษฎร์ธานี",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีพเวียงสา",
    "province": "น่าน",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพเวียงเชียงรุ้ง",
    "province": "เชียงราย",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพเสนา",
    "province": "พระนครศรีอยุธยา",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพแกลง",
    "province": "ระยอง",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยการอาชีพแก้งคร้อ",
    "province": "ชัยภูมิ",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพแจ้ห่ม ",
    "province": "ลำปาง",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพแม่น้ำแคว",
    "province": "กาญจนบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพแม่สะเรียง",
    "province": "แม่ฮ่องสอน",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพโนนดินแดง",
    "province": "บุรีรัมย์",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพโพธิ์ทอง",
    "province": "อ่างทอง",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยการอาชีพโพนทอง",
    "province": "ร้อยเอ็ด",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยการอาชีพไชยา",
    "province": "สุราษฎร์ธานี",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยการอาชีวศึกษาปทุมธานี",
    "province": "ปทุมธานี",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยบริหารธุรกิจและการท่องเที่ยวกรุงเทพ",
    "province": "กรุงเทพมหานคร",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยบริหารธุรกิจและการท่องเที่ยวนครราชสีมา",
    "province": "นครราชสีมา",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยประมงชุมพรเขตรอุดมศักดิ์",
    "province": "ชุมพร",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยประมงติณสูลานนท์",
    "province": "สงขลา",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยประมงสมุทรสาคร",
    "province": "สมุทรสาคร",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยพณิชยการธนบุรี",
    "province": "กรุงเทพมหานคร",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยพณิชยการบางนา",
    "province": "กรุงเทพมหานคร",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยพณิชยการบึงพระพิษณุโลก",
    "province": "พิษณุโลก",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยพณิชยการอินทราชัย",
    "province": "กรุงเทพมหานคร",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยพณิชยการเชตุพน",
    "province": "กรุงเทพมหานคร",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยศิลปหัตถกรรมกรุงเทพ",
    "province": "กรุงเทพมหานคร",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยศิลปหัตถกรรมนครศรีธรรมราช",
    "province": "นครศรีธรรมราช",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยสารพัดช่างกระบี่",
    "province": "กระบี่",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยสารพัดช่างกำแพงเพชร",
    "province": "กำแพงเพชร",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยสารพัดช่างจันทบุรี",
    "province": "จันทบุรี",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยสารพัดช่างฉะเชิงเทรา",
    "province": "ฉะเชิงเทรา",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยสารพัดช่างตรัง",
    "province": "ตรัง",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยสารพัดช่างตราด",
    "province": "ตราด",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยสารพัดช่างธนบุรี",
    "province": "กรุงเทพมหานคร",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยสารพัดช่างนครปฐม",
    "province": "นครปฐม",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยสารพัดช่างนครศรีธรรมราช",
    "province": "นครศรีธรรมราช",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยสารพัดช่างนครหลวง",
    "province": "กรุงเทพมหานคร",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยสารพัดช่างน่าน",
    "province": "น่าน",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยสารพัดช่างบรรหาร-แจ่มใส",
    "province": "สุพรรณบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยสารพัดช่างพระนคร",
    "province": "กรุงเทพมหานคร",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยสารพัดช่างพระนครศรีอยุธยา",
    "province": "พระนครศรีอยุธยา",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยสารพัดช่างพัทลุง",
    "province": "พัทลุง",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยสารพัดช่างพิษณุโลก",
    "province": "พิษณุโลก",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยสารพัดช่างภูเก็ต",
    "province": "ภูเก็ต",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยสารพัดช่างราชบุรี",
    "province": "ราชบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยสารพัดช่างลพบุรี",
    "province": "ลพบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยสารพัดช่างลำปาง",
    "province": "ลำปาง",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยสารพัดช่างศรีสะเกษ",
    "province": "ศรีสะเกษ",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยสารพัดช่างสมุทรปราการ",
    "province": "สมุทรปราการ",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยสารพัดช่างสมุทรสงคราม",
    "province": "สมุทรสงคราม",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยสารพัดช่างสระบุรี",
    "province": "สระบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยสารพัดช่างสี่พระยา",
    "province": "กรุงเทพมหานคร",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยสารพัดช่างสุราษฎร์ธานี",
    "province": "สุราษฎร์ธานี",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยสารพัดช่างสุรินทร์",
    "province": "สุรินทร์",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยสารพัดช่างสุโขทัย",
    "province": "สุโขทัย",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยสารพัดช่างอุดรธานี",
    "province": "อุดรธานี",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยสารพัดช่างอุตรดิตถ์",
    "province": "อุตรดิตถ์",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยสารพัดช่างอุทัยธานี",
    "province": "อุทัยธานี",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยสารพัดช่างเชียงใหม่",
    "province": "เชียงใหม่",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยสารพัดช่างเพชรบุรี",
    "province": "เพชรบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยสารพัดช่างเพชรบูรณ์",
    "province": "เพชรบูรณ์",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยสารพัดช่างแพร่",
    "province": "แพร่",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษากาญจนบุรี",
    "province": "กาญจนบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาขอนแก่น",
    "province": "ขอนแก่น",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาฉะเชิงเทรา",
    "province": "ฉะเชิงเทรา",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาชลบุรี",
    "province": "ชลบุรี",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาชุมพร",
    "province": "ชุมพร",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาธนบุรี",
    "province": "กรุงเทพมหานคร",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษานครปฐม",
    "province": "นครปฐม",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษานครราชสีมา",
    "province": "นครราชสีมา",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษานครศรีธรรมราช",
    "province": "นครศรีธรรมราช",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษานครสวรรค์",
    "province": "นครสวรรค์",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาปัตตานี",
    "province": "ปัตตานี",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาพระนครศรีอยุธยา",
    "province": "พระนครศรีอยุธยา",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาพิจิตร",
    "province": "พิจิตร",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาพิษณุโลก",
    "province": "พิษณุโลก",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาภูเก็ต",
    "province": "ภูเก็ต",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษามหาสารคาม",
    "province": "มหาสารคาม",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษายะลา",
    "province": "ยะลา",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาร้อยเอ็ด",
    "province": "ร้อยเอ็ด",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาลพบุรี",
    "province": "ลพบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาลำปาง",
    "province": "ลำปาง",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาสกลนคร",
    "province": "สกลนคร",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาสงขลา",
    "province": "สงขลา",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาสระบุรี",
    "province": "สระบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาสิงห์บุรี",
    "province": "สิงห์บุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาสุพรรณบุรี",
    "province": "สุพรรณบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาสุราษฎร์ธานี",
    "province": "สุราษฎร์ธานี",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาสุรินทร์",
    "province": "สุรินทร์",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาสุโขทัย",
    "province": "สุโขทัย",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาหนองคาย",
    "province": "หนองคาย",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาอุดรธานี",
    "province": "อุดรธานี",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาอุตรดิตถ์",
    "province": "อุตรดิตถ์",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาอุบลราชธานี",
    "province": "อุบลราชธานี",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาเชียงราย",
    "province": "เชียงราย",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาเชียงใหม่",
    "province": "เชียงใหม่",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาเทคโนโลยีฐานวิทยาศาสตร์ (ชลบุรี)",
    "province": "ชลบุรี",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาเพชรบุรี",
    "province": "เพชรบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาเมืองชัยภูมิ",
    "province": "ชัยภูมิ",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาเลย",
    "province": "เลย",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาเสาวภา",
    "province": "กรุงเทพมหานคร",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาเอี่ยมละออ",
    "province": "กรุงเทพมหานคร",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยอาชีวศึกษาแพร่",
    "province": "แพร่",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีกระบี่",
    "province": "กระบี่",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีกาญจนบุรี",
    "province": "กาญจนบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีกำแพงเพชร",
    "province": "กำแพงเพชร",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีขอนแก่น",
    "province": "ขอนแก่น",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีฉะเชิงเทรา",
    "province": "ฉะเชิงเทรา",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีชลบุรี",
    "province": "ชลบุรี",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีชัยนาท",
    "province": "ชัยนาท",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีชัยภูมิ",
    "province": "ชัยภูมิ",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีชุมพร",
    "province": "ชุมพร",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีตรัง",
    "province": "ตรัง",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีตาก",
    "province": "ตาก",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีนครราชสีมา",
    "province": "นครราชสีมา",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีนครศรีธรรมราช",
    "province": "นครศรีธรรมราช",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีนครสวรรค์",
    "province": "นครสวรรค์",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีบุรีรัมย์",
    "province": "บุรีรัมย์",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีพะเยา",
    "province": "พะเยา",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีพังงา",
    "province": "พังงา",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีพัทลุง",
    "province": "พัทลุง",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีพิจิตร",
    "province": "พิจิตร",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีมหาสารคาม",
    "province": "มหาสารคาม",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยียโสธร",
    "province": "ยโสธร",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีระนอง",
    "province": "ระนอง",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีราชบุรี",
    "province": "ราชบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีร้อยเอ็ด",
    "province": "ร้อยเอ็ด",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีลพบุรี",
    "province": "ลพบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีลำพูน",
    "province": "ลำพูน",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีศรีสะเกษ",
    "province": "ศรีสะเกษ",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีศูนย์ศิลปาชีพบางไทร",
    "province": "พระนครศรีอยุธยา",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีสงขลา",
    "province": "สงขลา",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีสตูล",
    "province": "สตูล",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีสระแก้ว",
    "province": "สระแก้ว",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีสิงห์บุรี",
    "province": "สิงห์บุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีสุพรรณบุรี",
    "province": "สุพรรณบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีสุราษฎร์ธานี",
    "province": "สุราษฎร์ธานี",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีสุโขทัย",
    "province": "สุโขทัย",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีอุดรธานี",
    "province": "อุดรธานี",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีอุทัยธานี",
    "province": "อุทัยธานี",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีอุบลราชธานี",
    "province": "อุบลราชธานี",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีเชียงราย",
    "province": "เชียงราย",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีเชียงใหม่",
    "province": "เชียงใหม่",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีเพชรบุรี",
    "province": "เพชรบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีเพชรบูรณ์",
    "province": "เพชรบูรณ์",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเกษตรและเทคโนโลยีแพร่",
    "province": "แพร่",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิค กฟผ. แม่เมาะ",
    "province": "ลำปาง",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคกระบี่",
    "province": "กระบี่",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเทคนิคกันทรลักษ์",
    "province": "ศรีสะเกษ",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคกันทรารมย์",
    "province": "ศรีสะเกษ",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคกาญจนดิษฐ์",
    "province": "สุราษฎร์ธานี",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเทคนิคกาญจนบุรี",
    "province": "กาญจนบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเทคนิคกาญจนาภิเษกปัตตานี",
    "province": "ปัตตานี",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเทคนิคกาญจนาภิเษกมหานคร",
    "province": "กรุงเทพมหานคร",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคกาญจนาภิเษกสมุทรปราการ",
    "province": "สมุทรปราการ",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคกาญจนาภิเษกอุดรธานี",
    "province": "อุดรธานี",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคกาญจนาภิเษกเชียงราย",
    "province": "เชียงราย",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคกาฬสินธุ์",
    "province": "กาฬสินธุ์",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคกำแพงเพชร",
    "province": "กำแพงเพชร",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคขอนแก่น",
    "province": "ขอนแก่น",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคคูเมือง",
    "province": "บุรีรัมย์",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคจะนะ",
    "province": "สงขลา",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเทคนิคจันทบุรี",
    "province": "จันทบุรี",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคจุฬาภรณ์ (ลาดขวาง)",
    "province": "ฉะเชิงเทรา",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคฉะเชิงเทรา",
    "province": "ฉะเชิงเทรา",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคชลบุรี",
    "province": "ชลบุรี",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคชัยนาท",
    "province": "ชัยนาท",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเทคนิคชัยภูมิ",
    "province": "ชัยภูมิ",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคชุมพร",
    "province": "ชุมพร",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเทคนิคชุมแพ",
    "province": "ขอนแก่น",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคดอกคำใต้",
    "province": "พะเยา",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคดอนเมือง",
    "province": "กรุงเทพมหานคร",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคดุสิต",
    "province": "กรุงเทพมหานคร",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคตระการพืชผล",
    "province": "อุบลราชธานี",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคตรัง",
    "province": "ตรัง",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเทคนิคตราด",
    "province": "ตราด",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคตาก",
    "province": "ตาก",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคถลาง",
    "province": "ภูเก็ต",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเทคนิคทุ่งสง",
    "province": "นครศรีธรรมราช",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเทคนิคท่าหลวง",
    "province": "ลพบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเทคนิคท่าหลวงซิเมนต์ไทยอนุสรณ์",
    "province": "สระบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเทคนิคธัญบุรี",
    "province": "ปทุมธานี",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคนครขอนแก่น",
    "province": "ขอนแก่น",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคนครนายก",
    "province": "นครนายก",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคนครปฐม",
    "province": "นครปฐม",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเทคนิคนครพนม",
    "province": "นครพนม",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคนครราชสีมา",
    "province": "นครราชสีมา",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคนครลำปาง",
    "province": "ลำปาง",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคนครศรีธรรมราช",
    "province": "นครศรีธรรมราช",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเทคนิคนครสวรรค์",
    "province": "นครสวรรค์",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคนครอุบลราชธานี",
    "province": "อุบลราชธานี",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคนครโคราช",
    "province": "นครราชสีมา",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคนนทบุรี",
    "province": "นนทบุรี",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคนวมินทราชินีมุกดาหาร",
    "province": "มุกดาหาร",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคนางรอง",
    "province": "บุรีรัมย์",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคนิคมอุตสาหกรรมระยอง",
    "province": "ระยอง",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคน่าน",
    "province": "น่าน",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคน้ำพอง",
    "province": "ขอนแก่น",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคบัวใหญ่",
    "province": "นครราชสีมา",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคบางนรา",
    "province": "นราธิวาส",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเทคนิคบางสะพาน",
    "province": "ประจวบคีรีขันธ์",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเทคนิคบางแสน",
    "province": "ชลบุรี",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคบึงกาฬ",
    "province": "บึงกาฬ",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคบุรีรัมย์",
    "province": "บุรีรัมย์",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคบูรพาปราจีน",
    "province": "ปราจีนบุรี",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคบ้านค่าย",
    "province": "ระยอง",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคบ้านแพง",
    "province": "นครพนม",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคปทุมธานี",
    "province": "ปทุมธานี",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคประจวบคีรีขันธ์",
    "province": "ประจวบคีรีขันธ์",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเทคนิคปราจีนบุรี",
    "province": "ปราจีนบุรี",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคปักธงชัย",
    "province": "นครราชสีมา",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคปัตตานี",
    "province": "ปัตตานี",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเทคนิคปัว",
    "province": "น่าน",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคปากช่อง",
    "province": "นครราชสีมา",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคป่าพะยอม",
    "province": "พัทลุง",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเทคนิคพนมสารคาม",
    "province": "ฉะเชิงเทรา",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคพยัคฆภูมิพิสัย",
    "province": "มหาสารคาม",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคพระนครศรีอยุธยา",
    "province": "พระนครศรีอยุธยา",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเทคนิคพะเยา",
    "province": "พะเยา",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคพังงา",
    "province": "พังงา",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเทคนิคพัทยา",
    "province": "ชลบุรี",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคพัทลุง",
    "province": "พัทลุง",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเทคนิคพิจิตร",
    "province": "พิจิตร",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคพิบูลมังสาหาร",
    "province": "อุบลราชธานี",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคพิมาย",
    "province": "นครราชสีมา",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคพิษณุโลก",
    "province": "พิษณุโลก",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคภูเก็ต",
    "province": "ภูเก็ต",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเทคนิคมวกเหล็ก",
    "province": "สระบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเทคนิคมหาสารคาม",
    "province": "มหาสารคาม",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคมาบตาพุด",
    "province": "ระยอง",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคมีนบุรี",
    "province": "กรุงเทพมหานคร",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคยะลา",
    "province": "ยะลา",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเทคนิคยโสธร",
    "province": "ยโสธร",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคระนอง",
    "province": "ระนอง",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเทคนิคระยอง",
    "province": "ระยอง",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิครัตนบุรี",
    "province": "สุรินทร์",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคราชบุรี",
    "province": "ราชบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเทคนิคราชบุรี 2",
    "province": "ราชบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเทคนิคราชสิทธาราม",
    "province": "กรุงเทพมหานคร",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคราษีไศล",
    "province": "ศรีสะเกษ",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคร้อยเอ็ด",
    "province": "ร้อยเอ็ด",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคลพบุรี",
    "province": "ลพบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเทคนิคลพบุรี แห่งที่ 2",
    "province": "ลพบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเทคนิคลำปาง",
    "province": "ลำปาง",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคลำพูน",
    "province": "ลำพูน",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิควังน้ำเย็น",
    "province": "สระแก้ว",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิควาปีปทุม",
    "province": "มหาสารคาม",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคศรีสะเกษ",
    "province": "ศรีสะเกษ",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคสกลนคร",
    "province": "สกลนคร",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคสงขลา",
    "province": "สงขลา",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเทคนิคสตูล",
    "province": "สตูล",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเทคนิคสมุทรปราการ",
    "province": "สมุทรปราการ",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคสมุทรสงคราม",
    "province": "สมุทรสงคราม",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเทคนิคสมุทรสาคร",
    "province": "สมุทรสาคร",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเทคนิคสระบุรี",
    "province": "สระบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเทคนิคสระแก้ว",
    "province": "สระแก้ว",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคสว่างแดนดิน",
    "province": "สกลนคร",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคสองแคว",
    "province": "พิษณุโลก",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคสัตหีบ",
    "province": "ชลบุรี",
    "region": "ภาคตะวันออกและกรุงเทพมหานคร"
  },
  {
    "name": "วิทยาลัยเทคนิคสันกำแพง",
    "province": "เชียงใหม่",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคสารภี",
    "province": "เชียงใหม่",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคสิงห์บุรี",
    "province": "สิงห์บุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเทคนิคสิงห์บุรี แห่งที่ 2",
    "province": "สิงห์บุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเทคนิคสิชล",
    "province": "นครศรีธรรมราช",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเทคนิคสุพรรณบุรี",
    "province": "สุพรรณบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเทคนิคสุรนารี",
    "province": "นครราชสีมา",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคสุราษฎร์ธานี",
    "province": "สุราษฎร์ธานี",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเทคนิคสุรินทร์",
    "province": "สุรินทร์",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคสุวรรณภูมิ",
    "province": "ร้อยเอ็ด",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคสุโขทัย",
    "province": "สุโขทัย",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคหนองคาย",
    "province": "หนองคาย",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคหนองบัวลำภู",
    "province": "หนองบัวลำภู",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคหลวงพ่อคูณ ปริสุทฺโธ",
    "province": "นครราชสีมา",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคหัวตะพาน",
    "province": "อำนาจเจริญ",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคหาดใหญ่",
    "province": "สงขลา",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเทคนิคอำนาจเจริญ",
    "province": "อำนาจเจริญ",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคอุดรธานี",
    "province": "อุดรธานี",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคอุตรดิตถ์",
    "province": "อุตรดิตถ์",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคอุตสาหกรรมยานยนต์",
    "province": "พระนครศรีอยุธยา",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเทคนิคอุทัยธานี",
    "province": "อุทัยธานี",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคอุบลราชธานี",
    "province": "อุบลราชธานี",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคอ่างทอง",
    "province": "อ่างทอง",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเทคนิคเกษตรวิสัย",
    "province": "ร้อยเอ็ด",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคเขมราฐ",
    "province": "อุบลราชธานี",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคเขาวง",
    "province": "กาฬสินธุ์",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคเชียงคำ",
    "province": "พะเยา",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคเชียงราย",
    "province": "เชียงราย",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคเชียงใหม่",
    "province": "เชียงใหม่",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคเซกา",
    "province": "บึงกาฬ",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคเดชอุดม",
    "province": "อุบลราชธานี",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคเทิง",
    "province": "เชียงราย",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคเพชรบุรี",
    "province": "เพชรบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเทคนิคเพชรบูรณ์",
    "province": "เพชรบูรณ์",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคเลย",
    "province": "เลย",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคเลิงนกทา",
    "province": "ยโสธร",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคเวียงป่าเป้า",
    "province": "เชียงราย",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคแพร่",
    "province": "แพร่",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคแม่วงก์",
    "province": "นครสวรรค์",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคแม่สอด",
    "province": "ตาก",
    "region": "ภาคเหนือ"
  },
  {
    "name": "วิทยาลัยเทคนิคโคกสำโรง",
    "province": "ลพบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเทคนิคโพธาราม",
    "province": "ราชบุรี",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเทคโนโลยีการเกษตรและประมงปัตตานี",
    "province": "ปัตตานี",
    "region": "ภาคใต้"
  },
  {
    "name": "วิทยาลัยเทคโนโลยีเกษตรอุตสาหกรรมชั้นสูงขอนแก่น",
    "province": "ขอนแก่น",
    "region": "ภาคตะวันออกเฉียงเหนือ"
  },
  {
    "name": "วิทยาลัยเทคโนโลยีและอุตสาหกรรมการต่อเรือพระนครศรีอยุธยา",
    "province": "พระนครศรีอยุธยา",
    "region": "ภาคกลาง"
  },
  {
    "name": "วิทยาลัยเสริมทักษะพระภิกษุ สามเณร",
    "province": "พระนครศรีอยุธยา",
    "region": "ภาคกลาง"
  }
];
